Revit 2026 API

# ConnectorElementCreatePipeConnector(Document, PipeSystemType, Reference) Method

---

Create a new pipe ConnectorElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ConnectorElement CreatePipeConnector(
	Document document,
	PipeSystemType pipeSystemType,
	Reference planarFace
)
```
```vb
Public Shared Function CreatePipeConnector (
	document As Document,
	pipeSystemType As PipeSystemType,
	planarFace As Reference
) As ConnectorElement
```
```cpp
public:
static ConnectorElement^ CreatePipeConnector(
	Document^ document,
	PipeSystemType pipeSystemType,
	Reference^ planarFace
)
```
```fsharp
static member CreatePipeConnector :
        document : Document *
        pipeSystemType : PipeSystemType *
        planarFace : Reference -> ConnectorElement
```

#### Parameters

document Document
     The document to add the connector to.
pipeSystemType PipeSystemType
     The PipeSystemType of the connector.
planarFace Reference
     The planar face to place the connector on.

#### Return Value

ConnectorElement The pipe ConnectorElement.

| Exception | Condition |
| --- | --- |
| ArgumentException | The reference is not a planar face. -or- document is not a family document. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | Connector creation is not allowed in this family. |

Regenerates the document.

#### Reference

ConnectorElement Class

CreatePipeConnector Overload

Autodesk.Revit.DB Namespace